const alcohols = [
  {
    whisky : {
      drinks : [
        {
          name : "ウイスキーサワー",
          with : ["ウイスキー","レモンジュース","砂糖"],
          ratio : ["45ml","20ml","1tsp"]
        }, {
          name : "ハイボール",
          with : ["ウイスキー","ソーダ水"],
          ratio : "1:3"
        },{
          name : "ウイスキーフロート",
          with : ["ウイスキー","ミネラルウォーター"],
          ratio : ["40ml","適量"]
        }, {
          name : "ゴッドファーザー",
          with : ["バランタイン","アマレット"],
          ratio : "3:1"
        },{
          name : "マミーテイラー",
          with : ["ウイスキー","レモンジュース","ジンジャエール"],
          ratio : ["45ml","20ml","適量"]
        }, {
          name : "バーボンハック",
          with : ["メーカーズマーク","ジンジャエール"],
          ratio : ["30ml","適量"]
        }
      ],
      snacks : {
        name : "アスパラのチーズ生ハム巻き",
        ingredients: ["アスパラ","生ハム","チーズ","塩"],
        stocks: ["1本", "1枚", "1適量", "適量"]
      },
      save : "冷蔵庫"
    },
    beer : {
      drinks : [
        {
          name : "レッドアイ",
          with : ["ビール","トマトジュース"],
          ratio : "1:1"
        }, {
          name : "シャンディガフ",
          with : ["ビール","ジンジャエール"],
          ratio : "1:1"
        },{
          name : "パナシェ",
          with : ["ビール","CCレモン"],
          ratio : "1:1"
        }, {
          name : "ブラックベルベット",
          with : ["ビール","シャンパン"],
          ratio : "1:1"
        }
      ],
      snacks : {
        name : "アスパラのチーズ生ハム巻き",
        ingredients: ["アスパラ","生ハム","チーズ","塩"],
        stocks: ["1本", "1枚", "1適量", "適量"]
      },
      save : "冷蔵庫"
    },
    gin : {
      drinks : [
        {
          name : "オレンジブロッサム",
          with : ["ジン","オレンジジュース"],
          ratio : ["45ml","適量"]
        }, {
          name : "ギムレット",
          with : ["ドライジン","ライムジュース","砂糖"],
          ratio : ["3:1","1tsp"]
        },{
          name : "ジントニック",
          with : ["ジン","トニックウォーター"],
          ratio : ["45ml","適量"]
        }, {
          name : "ジンソーダ",
          with : ["ジン","ソーダ水"],
          ratio : ["45ml","適量"]
        },{
          name : "ドッグスノーズ",
          with : ["ジン","ビール"],
          ratio : ["45ml","適量"]
        }
      ],
      snacks : {
        name : "生ハムチーズクラッカー",
        ingredients: ["生ハム","チーズ","クラッカー"],
        stocks: "それぞれ適量"
      },
      save : "冷蔵庫"
    },
    vodka : {
      drinks : [
        {
          name : "ソルティドッグ",
          with : ["ウォッカ","グレープフルーツジュース","塩"],
          ratio : ["45ml","適量","適量"]
        }, {
          name : "ギムレット",
          with : ["ウォッカ","ライムジュース","ジンジャエール"],
          ratio : ["45ml","15ml","適量"]
        },{
          name : "ウォッカトニック",
          with : ["ウォッカ","トニックウォーター"],
          ratio : "1:4"
        }, {
          name : "ビッグアップル",
          with : ["ウォッカ","アップルジュース"],
          ratio : ["45ml","適量"]
        },{
          name : "ドッグスノーズ",
          with : ["ウォッカ","トマトジュース","ビール"],
          ratio : ["45ml","60ml","適量"]
        }
      ],
      snacks : {
        name : "たらこクリームチーズのカナッペ",
        ingredients: ["たらこ","クリームチーズ","クラッカー"],
        stocks: ["1本", "50g", "適量"]
      },
      save : "冷蔵庫"
    },
    wine : {
      drinks : [
        {
          name : "アップルプラン",
          with : ["ルジェグリーンアップル","白ワイン"],
          ratio : "4:1"
        }, {
          name : "カーディナル",
          with : ["ルジェクレームドカシス","赤ワイン"],
          ratio : "1:4"
        },{
          name : "キール",
          with : ["ルジェクレームドカシス","白ワイン"],
          ratio : "1:4"
        }, {
          name : "スプリッツァー",
          with : ["ソーダ水","白ワイン"],
          ratio : "2:3"
        },{
          name : "ルジェブルーベリースプリッツァー",
          with : ["ルジェクレームドブルーベリー","赤ワイン","ソーダ水"],
          ratio : ["30ml","45ml","適量"]
        },{
          name : "ワインクーラー",
          with : ["赤ワイン","オレンジジュース","グレナデンシロップ","ホワイトキュラソー"],
          ratio : ["90ml","30ml","15ml","10ml"]
        }
      ],
      snacks : {
        name : "アスパラのチーズ生ハム巻き",
        ingredients: ["アスパラ","生ハム","チーズ","塩"],
        stocks: ["1本", "1枚", "1適量", "適量"]
      },
      save : "冷蔵庫"
    }
  }
];
